SiliconLabs/simplicity_sdk/platform/Device/SiliconLabs/EFR32MG26/Include/efr32mg26_msc.h
/* Bit fields for MSC PAGELOCKWORD4 */
#define _MSC_PAGELOCKWORD4_RESETVALUE             0x00000000UL                              /**< Default value for MSC_PAGELOCKWORD4         */
#define _MSC_PAGELOCKWORD4_MASK                   0xFFFFFFFFUL                              /**< Mask for MSC_PAGELOCKWORD4                  */
#define _MSC_PAGELOCKWORD4_LOCKBIT_SHIFT          0                                         /**< Shift value for MSC_LOCKBIT                 */
#define _MSC_PAGELOCKWORD4_LOCKBIT_MASK           0xFFFFFFFFUL                              /**< Bit mask for MSC_LOCKBIT                    */
#define _MSC_PAGELOCKWORD4_LOCKBIT_DEFAULT        0x00000000UL                              /**< Mode DEFAULT for MSC_PAGELOCKWORD4          */
#define MSC_PAGELOCKWORD4_LOCKBIT_DEFAULT         (_MSC_PAGELOCKWORD4_LOCKBIT_DEFAULT << 0) /**< Shifted mode DEFAULT for MSC_PAGELOCKWORD4  */

/* Bit fields for MSC PAGELOCKWORD5 */
#define _MSC_PAGELOCKWORD5_RESETVALUE             0x00000000UL                              /**< Default value for MSC_PAGELOCKWORD5         */
#define _MSC_PAGELOCKWORD5_MASK                   0xFFFFFFFFUL                              /**< Mask for MSC_PAGELOCKWORD5                  */
#define _MSC_PAGELOCKWORD5_LOCKBIT_SHIFT          0                                         /**< Shift value for MSC_LOCKBIT                 */
#define _MSC_PAGELOCKWORD5_LOCKBIT_MASK           0xFFFFFFFFUL                              /**< Bit mask for MSC_LOCKBIT                    */
#define _MSC_PAGELOCKWORD5_LOCKBIT_DEFAULT        0x00000000UL                              /**< Mode DEFAULT for MSC_PAGELOCKWORD5          */
#define MSC_PAGELOCKWORD5_LOCKBIT_DEFAULT         (_MSC_PAGELOCKWORD5_LOCKBIT_DEFAULT << 0) /**< Shifted mode DEFAULT for MSC_PAGELOCKWORD5  */

/* Bit fields for MSC PAGELOCKWORD6 */
#define _MSC_PAGELOCKWORD6_RESETVALUE             0x00000000UL                              /**< Default value for MSC_PAGELOCKWORD6         */
#define _MSC_PAGELOCKWORD6_MASK                   0xFFFFFFFFUL                              /**< Mask for MSC_PAGELOCKWORD6                  */
#define _MSC_PAGELOCKWORD6_LOCKBIT_SHIFT          0                                         /**< Shift value for MSC_LOCKBIT                 */
#define _MSC_PAGELOCKWORD6_LOCKBIT_MASK           0xFFFFFFFFUL                              /**< Bit mask for MSC_LOCKBIT                    */
#define _MSC_PAGELOCKWORD6_LOCKBIT_DEFAULT        0x00000000UL                              /**< Mode DEFAULT for MSC_PAGELOCKWORD6          */
#define MSC_PAGELOCKWORD6_LOCKBIT_DEFAULT         (_MSC_PAGELOCKWORD6_LOCKBIT_DEFAULT << 0) /**< Shifted mode DEFAULT for MSC_PAGELOCKWORD6  */

/* Bit fields for MSC PAGELOCKWORD7 */
#define _MSC_PAGELOCKWORD7_RESETVALUE             0x00000000UL                              /**< Default value for MSC_PAGELOCKWORD7         */
#define _MSC_PAGELOCKWORD7_MASK                   0xFFFFFFFFUL                              /**< Mask for MSC_PAGELOCKWORD7                  */
#define _MSC_PAGELOCKWORD7_LOCKBIT_SHIFT          0                                         /**< Shift value for MSC_LOCKBIT                 */
#define _MSC_PAGELOCKWORD7_LOCKBIT_MASK           0xFFFFFFFFUL                              /**< Bit mask for MSC_LOCKBIT                    */
#define _MSC_PAGELOCKWORD7_LOCKBIT_DEFAULT        0x00000000UL                              /**< Mode DEFAULT for MSC_PAGELOCKWORD7          */
#define MSC_PAGELOCKWORD7_LOCKBIT_DEFAULT         (_MSC_PAGELOCKWORD7_LOCKBIT_DEFAULT << 0) /**< Shifted mode DEFAULT for MSC_PAGELOCKWORD7  */

/* Bit fields for MSC PAGELOCKWORD8 */
#define _MSC_PAGELOCKWORD8_RESETVALUE             0x00000000UL                              /**< Default value for MSC_PAGELOCKWORD8         */
#define _MSC_PAGELOCKWORD8_MASK                   0xFFFFFFFFUL                              /**< Mask for MSC_PAGELOCKWORD8                  */
#define _MSC_PAGELOCKWORD8_LOCKBIT_SHIFT          0                                         /**< Shift value for MSC_LOCKBIT                 */
#define _MSC_PAGELOCKWORD8_LOCKBIT_MASK           0xFFFFFFFFUL                              /**< Bit mask for MSC_LOCKBIT                    */
#define _MSC_PAGELOCKWORD8_LOCKBIT_DEFAULT        0x00000000UL                              /**< Mode DEFAULT for MSC_PAGELOCKWORD8          */
#define MSC_PAGELOCKWORD8_LOCKBIT_DEFAULT         (_MSC_PAGELOCKWORD8_LOCKBIT_DEFAULT << 0) /**< Shifted mode DEFAULT for MSC_PAGELOCKWORD8  */

/* Bit fields for MSC PAGELOCKWORD9 */
#define _MSC_PAGELOCKWORD9_RESETVALUE             0x00000000UL                              /**< Default value for MSC_PAGELOCKWORD9         */
#define _MSC_PAGELOCKWORD9_MASK                   0xFFFFFFFFUL                              /**< Mask for MSC_PAGELOCKWORD9                  */
#define _MSC_PAGELOCKWORD9_LOCKBIT_SHIFT          0                                         /**< Shift value for MSC_LOCKBIT                 */
#define _MSC_PAGELOCKWORD9_LOCKBIT_MASK           0xFFFFFFFFUL                              /**< Bit mask for MSC_LOCKBIT                    */
#define _MSC_PAGELOCKWORD9_LOCKBIT_DEFAULT        0x00000000UL                              /**< Mode DEFAULT for MSC_PAGELOCKWORD9          */
#define MSC_PAGELOCKWORD9_LOCKBIT_DEFAULT         (_MSC_PAGELOCKWORD9_LOCKBIT_DEFAULT << 0) /**< Shifted mode DEFAULT for MSC_PAGELOCKWORD9  */

/* Bit fields for MSC PAGELOCKWORD10 */
#define _MSC_PAGELOCKWORD10_RESETVALUE            0x00000000UL                               /**< Default value for MSC_PAGELOCKWORD10        */
#define _MSC_PAGELOCKWORD10_MASK                  0xFFFFFFFFUL                               /**< Mask for MSC_PAGELOCKWORD10                 */
#define _MSC_PAGELOCKWORD10_LOCKBIT_SHIFT         0                                          /**< Shift value for MSC_LOCKBIT                 */
#define _MSC_PAGELOCKWORD10_LOCKBIT_MASK          0xFFFFFFFFUL                               /**< Bit mask for MSC_LOCKBIT                    */
#define _MSC_PAGELOCKWORD10_LOCKBIT_DEFAULT       0x00000000UL                               /**< Mode DEFAULT for MSC_PAGELOCKWORD10         */
#define MSC_PAGELOCKWORD10_LOCKBIT_DEFAULT        (_MSC_PAGELOCKWORD10_LOCKBIT_DEFAULT << 0) /**< Shifted mode DEFAULT for MSC_PAGELOCKWORD10 */

